transformation-library/src/test/resources/locationsummary/dsq.response/healthInsurancePermitNumberFailure.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">6f4ba799-80d6-4e41-9075-68d4957c0335</cais:TrackingId>
    <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">936a2e8f-412c-4b51-b62f-a2030010ca2b
    </cais:TransactionId>
    <cais:SessionID xmlns:cais="http://cais-icp.org/v1">8c4214ca2af947d7b0a66ff5f1ffc</cais:SessionID>
  </s:Header>
  <s:Body>
    <PRLO_IN202011CAQC_V01 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ITSVersion="XML_1.0"
                           xmlns="urn:hl7-org:v3">
      <id root="b71e1ab9-90ef-44c3-87c8-b972903bf5ee"/>
      <creationTime value="20211213215301"/>
      <responseModeCode code="I"/>
      <versionCode code="NE2006"/>
      <interactionId root="2.16.124.10.101.1.60.3.16" extension="PRLO_IN202011CAQC_V01" displayable="true"/>
      <processingCode code="D"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="VPHXApplicationOID" extension="VPHXApplicationFullName" displayable="true" use="BUS"/>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </receiver>
      <respondTo xsi:nil="true"/>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
          <name>Registre ODS/LDS</name>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AE"/>
        <targetMessage>
          <id root="58a29b06-6079-4c52-8cb8-a645c8b9aef7"/>
        </targetMessage>
        <acknowledgementDetail>
          <typeCode code="E"/>
          <code code="SYN102"/>
          <text>Data type error</text>
          <location>
            PRLO_IN202010CAQC_V01/controlActEvent/queryByParameter/parameterList/address/value/postalCode
          </location>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActEvent classCode="CACT" moodCode="EVN">
        <id root="VPHXApplicationOID" extension="11111111" displayable="true" use="BUS"/>
        <code code="PRLO_TE202011CA"/>
        <statusCode code="completed"/>
        <queryAck>
          <queryId root="58a29b06-6079-4c52-8cb8-a645c8b9aef7"/>
          <queryResponseCode code="QE"/>
          <resultTotalQuantity value="0"/>
          <resultCurrentQuantity value="0"/>
          <resultRemainingQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId root="58a29b06-6079-4c52-8cb8-a645c8b9aef7"/>
          <parameterList>
            <address>
              <value>
                <streetAddressLine partType="SAL">string</streetAddressLine>
                <city partType="CTY">string</city>
                <postalCode partType="ZIP">string</postalCode>
                <country partType="CNT">string</country>
              </value>
            </address>
            <amendedSinceDateTime xsi:nil="true"/>
            <eHRRepositoryId xsi:nil="true"/>
            <locationMobileIndicator xsi:nil="true"/>
            <locationPlaceType xsi:nil="true"/>
            <nameContains>
              <value>string</value>
            </nameContains>
            <nearAddress xsi:nil="true"/>
            <recordType>
              <value code="HOSP"/>
            </recordType>
            <responsibleOrganizationId xsi:nil="true"/>
            <searchRadius xsi:nil="true"/>
            <OtherIDs>
              <value root="2.16.124.10.101.1.60.104" extension="213123213" displayable="true"/>
            </OtherIDs>
          </parameterList>
        </queryByParameter>
      </controlActEvent>
    </PRLO_IN202011CAQC_V01>
  </s:Body>
</s:Envelope>
